#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: d956b5fdccc304effed547a59464a4c2.pdb
; shader hash: d956b5fdccc304effed547a59464a4c2
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(32,1,1)
;
;
; Buffer Definitions:
;
; cbuffer CbView
; {
;
;   struct hostlayout.CbView
;   {
;
;       column_major float4x4 gView;                  ; Offset:    0
;   
;   } CbView;                                         ; Offset:    0 Size:    64
;
; }
;
; Resource bind info for gPointList
; {
;
;   struct struct.PointLight
;   {
;
;       float3 color;                                 ; Offset:    0
;       float intensity;                              ; Offset:   12
;       float3 position;                              ; Offset:   16
;       float range;                                  ; Offset:   28
;   
;   } $Element;                                       ; Offset:    0 Size:    32
;
; }
;
; Resource bind info for gOutputBoundingSphere
; {
;
;   float4 $Element;                                  ; Offset:    0 Size:    16
;
; }
;
;
; Resource Bindings:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2212.12 (8c9d92be7)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !38)
!1 = !DIFile(filename: "E:\5Cshare\5CEureka\5CEngine\5CEngineAssets\5CShaderPreCompile\5CUpdatePointLightBoundingSphere_CS.cs_6_0", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 31, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 31, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !18, file: !18, line: 25, type: !19, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DIFile(filename: "E:\5Cshare\5CEureka\5CEngine\5CEngineAssets\5CShaders\5CUpdateLightBoundingSphere.hlsl", directory: "")
!19 = !DISubroutineType(types: !20)
!20 = !{null, !21}
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComputeIn", file: !18, line: 15, size: 320, align: 32, elements: !22)
!22 = !{!23, !34, !35, !36}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "GroupID", scope: !21, file: !18, line: 16, baseType: !24, size: 96, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 4, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 4, size: 96, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 4, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 4, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 4, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!32, !33}
!32 = !DITemplateTypeParameter(name: "element", type: !28)
!33 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "GroupThreadID", scope: !21, file: !18, line: 17, baseType: !24, size: 96, align: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchThreadID", scope: !21, file: !18, line: 18, baseType: !24, size: 96, align: 32, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "GroupIndex", scope: !21, file: !18, line: 19, baseType: !37, size: 32, align: 32, offset: 288)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 4, baseType: !28)
!38 = !{!39, !63, !69, !86}
!39 = !DIGlobalVariable(name: "gView", linkageName: "\01?gView@CbView@@3V?$matrix@M$03$03@@B", scope: !0, file: !18, line: 4, type: !40, isLocal: false, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 4, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 4, size: 512, align: 32, elements: !43, templateParams: !60)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !42, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!60 = !{!13, !61, !62}
!61 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!62 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!63 = !DIGlobalVariable(name: "kDepthSlicing16", scope: !0, file: !64, line: 78, type: !65, isLocal: true, isDefinition: true)
!64 = !DIFile(filename: "E:\5Cshare\5CEureka\5CEngine\5CEngineAssets\5CShaders/Lighting.hlsli", directory: "")
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 544, align: 32, elements: !67)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!67 = !{!68}
!68 = !DISubrange(count: 17)
!69 = !DIGlobalVariable(name: "gPointList", linkageName: "\01?gPointList@@3V?$StructuredBuffer@UPointLight@@@@A", scope: !0, file: !18, line: 8, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<PointLight>", file: !1, line: 8, size: 256, align: 32, elements: !2, templateParams: !71)
!71 = !{!72}
!72 = !DITemplateTypeParameter(name: "element", type: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "PointLight", file: !64, line: 17, size: 256, align: 32, elements: !74)
!74 = !{!75, !83, !84, !85}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !73, file: !64, line: 18, baseType: !76, size: 96, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 29, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 29, size: 96, align: 32, elements: !78, templateParams: !82)
!78 = !{!79, !80, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !77, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !77, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !77, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!82 = !{!13, !33}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !73, file: !64, line: 19, baseType: !8, size: 32, align: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !73, file: !64, line: 20, baseType: !76, size: 96, align: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !73, file: !64, line: 21, baseType: !8, size: 32, align: 32, offset: 224)
!86 = !DIGlobalVariable(name: "gOutputBoundingSphere", linkageName: "\01?gOutputBoundingSphere@@3V?$RWStructuredBuffer@V?$vector@M$03@@@@A", scope: !0, file: !18, line: 13, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<vector<float, 4> >", file: !1, line: 13, size: 128, align: 32, elements: !2, templateParams: !88)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "element", type: !5)
!90 = !{i32 2, !"Dwarf Version", i32 4}
!91 = !{i32 2, !"Debug Info Version", i32 3}
!92 = !{!"dxcoob 1.7.2212.12 (8c9d92be7)"}
!93 = !{!"E:\5Cshare\5CEureka\5CEngine\5CEngineAssets\5CShaderPreCompile\5CUpdatePointLightBoundingSphere_CS.cs_6_0", !"#define CS main\0D\0A#define UPDATE_POINT_LIGHT\0D\0A\0D\0A#include \22UpdateLightBoundingSphere.hlsl\22"}
!94 = !{!"E:\5Cshare\5CEureka\5CEngine\5CEngineAssets\5CShaders\5CLighting.hlsli", !"#ifndef _LIGHTING_HLSLI_\0D\0A#define _LIGHTING_HLSLI_\0D\0A\0D\0A#ifndef SHARED_STRUCT\0D\0A\09#define SHARED_STRUCT \0D\0A#endif\0D\0A\0D\0Astruct DirectionalLight {\0D\0A\09float3 ambientColor;\0D\0A\09float  ambientIntensity;\0D\0A\09float3 directionalColor;\0D\0A\09float  directionalIntensity;\0D\0A\09float3 direction;\0D\0A\09float  padding0;\0D\0A};\0D\0A\0D\0Astruct PointLight {\0D\0A\09float3 color;\0D\0A\09float  intensity;\0D\0A\09float3 position;\0D\0A\09float  range;\0D\0A};\0D\0A\0D\0Astruct SpotLight {\0D\0A\09float3\09color;\0D\0A\09float\09intensity;\0D\0A\09float3\09position;\0D\0A\09float\09range;\0D\0A\09float3  direction;\0D\0A\09float\09boundingSphereRadius;\0D\0A\09float3  viewSpaceBoundingSphereCenter;\0D\0A\09float\09innerConeCosTheta;\0D\0A\09float\09outerConeCosTheta;\0D\0A};\0D\0A\0D\0A#define MAX_TILE_POINT_LIGHT_NUM\09160\0D\0A#define MAX_TILE_SPOT_LIGHT_NUM\09\09160\0D\0A#define TBDR_TILE_DIMENSION\09\09\0916\0D\0A#define TBDR_TILE_SIZE\09\09\09\09(TBDR_TILE_DIMENSION * TBDR_TILE_DIMENSION)\0D\0A\0D\0A#define CBDR_TILE_DIMENSION\09\09\0964\0D\0A#define CBDR_MAX_CLUSTER_DIMENSION\0916\0D\0A#define CBDR_TILE_SIZE\09\09\09\09(CBDR_TILE_DIMENSION * CBDR_TILE_DIMENSION)\0D\0A#define CBDR_THREAD_X\09\09\09\098\0D\0A#define CBDR_THREAD_Y\09\09\09\098\0D\0A\0D\0Astruct LightList {\0D\0A\09uint numPointLights;\0D\0A\09uint pointLightIndices[MAX_TILE_POINT_LIGHT_NUM];\0D\0A\09uint numSpotLights;\0D\0A\09uint spotLightIndices[MAX_TILE_SPOT_LIGHT_NUM];\0D\0A};\0D\0A\0D\0Astruct ClusterFrustum {\0D\0A\09float4 frustumPlanes[6];\0D\0A};\0D\0A\0D\0Auint DivideByMultiple(uint value, uint alignment) {\0D\0A\09return (value + alignment - 1) / alignment;\0D\0A}\0D\0A\0D\0Auint CalcTileIndex(uint renderTargetWidth, uint2 groupId) {\0D\0A\09uint numWidthTile = DivideByMultiple(renderTargetWidth, TBDR_TILE_DIMENSION);\0D\0A\09uint tileIndex = (groupId.y * numWidthTile + groupId.x);\0D\0A\09return tileIndex;\0D\0A}\0D\0A\0D\0A\0D\0Auint2 CalcClusterTileParam(uint renderTargetWidth, uint2 dispatchID, uint zClusterSize) {\0D\0A\09uint xTileSize = DivideByMultiple(renderTargetWidth, CBDR_TILE_DIMENSION);\0D\0A\09uint2 tileID = dispatchID / CBDR_TILE_DIMENSION;\0D\0A\09uint startIndex = (tileID.y * xTileSize + tileID.x) * zClusterSize;\0D\0A\09uint2 groupID = dispatchID % CBDR_TILE_DIMENSION;\0D\0A\09uint groupIndex = groupID.y * CBDR_TILE_DIMENSION + groupID.x;\0D\0A\09return uint2(startIndex, groupIndex);\0D\0A}\0D\0A\0D\0Astatic const float kDepthSlicing16[17] = {\0D\0A\091.0f, 20.0f, 29.7f, 44.0f, 65.3f,\0D\0A\0996.9f, 143.7f, 213.2f, 316.2f, 469.1f,\0D\0A\09695.9f, 1032.4f, 1531.5f, 2272.0f, 3370.5f,\0D\0A\095000.0f, 50000.0f\0D\0A};\0D\0A\0D\0Auint GetClusterIndex(float zView) {\0D\0A\09[unroll] for (uint i = 0; i < 17; ++i) {\0D\0A\09\09if (zView <= kDepthSlicing16[i])\0D\0A\09\09\09return i;\0D\0A\09}\0D\0A\09return 16;\0D\0A}\0D\0A\0D\0A#endif\0D\0A"}
